# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"

# CLI Tools
brew "autojump"
brew "broot"
brew "fd"
brew "fzf"
brew "nnn"

# Media 
brew "imagemagick"

# Development
brew "jq"
brew "r"
brew "neovim"
brew "ripgrep"
brew "tmux"

# Miscellaneous
brew "htop"
brew "glow"
brew "neofetch"
brew "stow"

# Shell Plugins 
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

# GUI Applications
cask "appcleaner"
cask "basictex" # *
cask "iterm2"
cask "messenger"
cask "miniforge" # * 
cask "postman"
cask "raycast"
cask "rectangle"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"

" Fonts 
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-iosevka"
